app/controllers/wines_controller.rb

  def show
    @wine = Wine.find(params[:id])
---
SELECT * FROM "wines" WHERE ("wines"."id" = 1)

  def create
    @wine = Wine.new(params[:wine])
    if @wine.save
---
INSERT INTO "wines" ("name", "created_at", "batch_number", "updated_at", "started") VALUES('Joe''s Ancient Orange Mead', '2010-04-02 17:21:23', 3, '2010-04-02 17:21:23', '2010-04-02 17:16:00')

  def edit
    @wine = Wine.find(params[:id])
---
SELECT * FROM "wines" WHERE ("wines"."id" = 1)

  def update
    @wine = Wine.find(params[:id])
---
SELECT * FROM "wines" WHERE ("wines"."id" = 1)